In [2]:
import pandas as pd
import numpy as np
from sklearn.utils.fixes import percentile

In [7]:
df = pd.read_csv('income.csv', names=['name', 'income'], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [8]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [15]:
df.income.quantile(0.25)

5000

In [12]:
df.income.quantile(0.75)

7750.0

In [13]:
df.income.quantile(0.50)

7000.0

In [17]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [19]:
df[df.income > percentile_99]

        name    income
6  Elon Musk  10000000

In [20]:
df_no_outliers = df[df.income <= percentile_99]
df_no_outliers

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [21]:
df_no_outliers.describe()

            income
count     6.000000
mean   6250.000000
std    1541.103501
min    4000.000000
25%    5250.000000
50%    6500.000000
75%    7375.000000
max    8000.000000

In [23]:
df['income'][3] = np.nan

/var/folders/m4/zw00zs7x0m7chsqwc4kb_lkr0000gn/T/ipykernel_16258/1376011356.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3] = np.nan

In [24]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [25]:
df.income.mean()

1671666.6666666667

In [26]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [27]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0